       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUMBERS.
       AUTHOR.     OPEN MAINFRAME LEARNER.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
      * DEFINING INPUT NUMBERS AND THE RESULT VARIABLES
       01 FIRST-NUMBER      PIC 9(4)   VALUE 2020.
       01 SECOND-NUMBER     PIC 9(4)   VALUE 1993.
       01 RESULT-SUBTREC    PIC S9(4).
       01 RESULT-DISPLAY    PIC +9(4).

       PROCEDURE DIVISION.
       0000-MAIN-LOGIC.
      *    PERFORMING ARITHMETIC USING THE COMPUTE VERB
           COMPUTE RESULT-SUBTREC = FIRST-NUMBER - SECOND-NUMBER.

      *    MOVING THE RAW DATA TO AN EDITED FORMAT FOR DISPLAY
           MOVE RESULT-SUBTREC TO RESULT-DISPLAY.
           DISPLAY "THE ARITHMETIC RESULT IS: " RESULT-DISPLAY.

           STOP RUN.
